{
    "name": "Force Field Projector",
    "icon": "mffs:projector",
    "category": "mffs:machines",
    "pages": [
        {
            "type": "patchouli:spotlight",
            "item": "mffs:projector",
            "link_recipe": true,
            "text": "The $(9)Force Field Projector$() is a fundamental part of the MFFS family of machines. It uses Fortron energy to project force fields of various shapes and sizes into the world."
        },
        {
            "type": "patchouli:crafting",
            "recipe": "mffs:projector",
            "text": "Crafting the $(9)Force Field Projector$()."
        },
        {
            "type": "patchouli:text",
            "title": "Usage",
            "text": "To make a force field, give the $(9)Force Field Projector$() a supply of Fortron by linking it to a nearby $(9)Fortron Capacitor$(). This can be achieved either by:$(li)Right-clicking the $(9)Force Field Projector$() and entering the matching frequency number into its GUI screen$(li)Shift-right-clicking the Projector while holding a Frequency Card."
        },
        {
            "type": "patchouli:text",
            "text": "Decide which force field shape to create by crafting one of the $(l:mffs:projector_modes)projector mode items$(). Right-click the Projector and place the projector mode item into the central (red) slot surrounded by outwardly facing arrows. Craft a number of $(5)Scale Module$() items and place them into the left-hand slot matrix of the $(9)Force Field Projector$()'s GUI. Each $(5)Scale Module$() used in the Projector's matrix slots will increase the force field radius by one block."
        },
        {
            "type": "patchouli:text",
            "text": "The number at the bottom of the GUI indicates how much Fortron is required to sustain a force field of the specified size and shape. Activate the Projector by supplying it with a Redstone signal. Once activated, the $(9)Force Field Projector$() will change from red to blue and begin projecting a force field (assuming it has enough available Fortron).$(p)To be able to walk through a force field, a $(l:mffs:machines/biometric_identifier)Biometric Identifier$() is needed."
        },
        {
            "type": "patchouli:text",
            "title": "Upgradability",
            "text": "A $(9)Force Field Projector$() may be augmented with various modules. These general modules have the following effects:$(li)$(5)Scale Module$(): Adjusts the shape of a projected force field.$(li)$(5)Speed Module$(): Allows the Projector to generate a force field more quickly.$(li)$(5)Capacity Module$(): Increases the amount of Fortron the Projector is able to store.$()"
        }
    ]
}